#+AUTHOR:    Anton S. Kosinov
#+TITLE:     Mental Athlete ToDo List
#+SUBTITLE:  Life in a plain text
#+EMAIL:     a.s.kosinov@gmail.com
#+LANGUAGE: en
#+STARTUP: showall
#+PROPERTY:header-args :results output :exports both
# :session :cache yes :tangle yes :comments org 
#+CATEGORY: New Article
#+TODO: TODO | MAYBE DONE CLOSED

* [#A] Time Management
  :PROPERTIES:
  :CATEGORY: MetaKnowledge
  :LAST_REPEAT: [2018-03-07 Wed 12:39]
  :END:
  - State "DONE"       from "TODO"       [2018-03-07 Wed 12:39]
  :LOGBOOK:
  CLOCK: [2018-03-07 Wed 12:39]--[2018-03-07 Wed 12:39] =>  0:00
  :END:
  <2018-03-14 Wed ++1w>

** [#A] Daily Agenda Composing
   :LOGBOOK:
   CLOCK: [2018-03-23 Fri 07:31]--[2018-03-23 Fri 07:34] =>  0:03
   CLOCK: [2018-03-16 Fri 09:33]--[2018-03-16 Fri 09:37] =>  0:04
   CLOCK: [2018-03-15 Thu 08:03]--[2018-03-15 Thu 08:14] =>  0:11
   CLOCK: [2018-03-12 Mon 09:34]--[2018-03-12 Mon 09:55] =>  0:21
   :END:
   <2018-03-08 Thu ++1d>

** Agenda commands
   :PROPERTIES:
   :CATEGORY: Org-mode
   :LAST_REPEAT: [2018-03-08 Thu 13:03]
   :END:
   - State "DONE"       from "TODO"       [2018-03-08 Thu 13:03]
   :LOGBOOK:
   CLOCK: [2018-03-08 Thu 12:58]--[2018-03-08 Thu 13:02] =>  0:04
   :END:
   [[info:org#Agenda%20commands][info:org#Agenda commands]]
   <2018-03-08 Thu ++1d>

** [#B] Regular events scheduling
   :LOGBOOK:
   CLOCK: [2018-03-08 Thu 13:05]--[2018-03-08 Thu 13:13] =>  0:08
   CLOCK: [2018-03-04 Sun 17:02]--[2018-03-04 Sun 17:23] =>  0:21
   :END:
   <2018-03-06 Tue ++1d> Hardcore time-schedule isn't a silver
   bullet and I'll follow for =Emacs= innate ~priority~ varying
   approach. We'll just exclde the =natural.org= with all
   bio-rthythms out from our Agenda by =C-x ]=

** TODO DevEnv Enhancement
   :PROPERTIES:
   :LAST_REPEAT: [2018-03-23 Fri 09:30]
   :END:
   - State "MAYBE"      from "TODO"       [2018-03-23 Fri 09:30]
   :LOGBOOK:
   CLOCK: [2018-03-23 Fri 09:15]--[2018-03-23 Fri 09:29] =>  0:14
   :END:
   <2018-03-30 Fri 08:00-08:30 ++1w>
   [[file:/usr/local/git/0--key/org-pub/2017-09-15-workspace.org::*Task%20switching][Task switching]]

** TODO Effort analysis
   :PROPERTIES:
   :LAST_REPEAT: [2018-03-23 Fri 09:03]
   :END:
   - State "MAYBE"      from "TODO"       [2018-03-23 Fri 09:03]
   <2018-03-30 Fri 07:30-08:00 ++1w>

* [#C] Writing
  :PROPERTIES:
  :CATEGORY: English
  :END:
  <%%(memq (calendar-day-of-week date) '(1 2 3 4 5))>

** Vocabulary
   :LOGBOOK:
   CLOCK: [2018-03-16 Fri 11:01]--[2018-03-16 Fri 11:21] =>  0:20
   CLOCK: [2018-03-15 Thu 09:30]--[2018-03-15 Thu 09:50] =>  0:20
   CLOCK: [2018-03-12 Mon 16:09]--[2018-03-12 Mon 16:24] =>  0:15
   CLOCK: [2018-03-12 Mon 14:38]--[2018-03-12 Mon 15:05] =>  0:27
   :END:
   <2018-03-24 Sat 10:30-11:00>
   <2018-03-13 Tue 15:30-16:00>
   [[file:/usr/local/git/0--key/lib/org/vocabulary/201803.org::*credentials][March Vocabulary]]

** Social Networking
   :PROPERTIES:
   :CATEGORY: LinkedIn
   :END:
   :LOGBOOK:
   CLOCK: [2018-03-13 Tue 11:14]--[2018-03-13 Tue 12:09] =>  0:55
   :END:
   <2018-03-24 Sat 11:30-12:00>

*** DONE Private repository
    :PROPERTIES:
    :CATEGORY: BitBucket
    :END:
    :LOGBOOK:
    CLOCK: [2018-03-12 Mon 15:40]--[2018-03-12 Mon 15:51] =>  0:11
    CLOCK: [2018-03-12 Mon 10:59]--[2018-03-12 Mon 11:28] =>  0:29
    :END:
    <2018-03-12 Mon 11:00-11:30>

    #+BEGIN_QUOTE
    Running "hg push"...
    pushing to https://Cosmic@bitbucket.org/Cosmic/stuff
    abort: http authorization required for https://bitbucket.org/Cosmic/stuff
    #+END_QUOTE
    [[file:/usr/local/hg/stuff/toolset.txt::This%20is%20a%20test%20string][startPoint]]

**** DONE Credentials
     :LOGBOOK:
     CLOCK: [2018-03-12 Mon 14:01]--[2018-03-12 Mon 14:26] =>  0:25
     :END:
     <2018-03-12 Mon 14:00-14:30>

** Development Story
   :LOGBOOK:
   CLOCK: [2018-03-13 Tue 10:57]--[2018-03-13 Tue 11:13] =>  0:16
   :END:
   <2018-03-24 Sat 11:00-11:30>
   [[file:/usr/local/hg/stuff/dev_story.org][txt]]
* NoSQL
  :PROPERTIES:
  :CATEGORY: NoSQL
  :END:

** Intro
   :LOGBOOK:
   CLOCK: [2018-03-12 Mon 15:15]--[2018-03-12 Mon 15:39] =>  0:24
   CLOCK: [2018-03-12 Mon 10:39]--[2018-03-12 Mon 10:59] =>  0:20
   :END:
   <2018-03-24 Sat 10:30-11:00>
   <2018-03-13 Tue 15:00-15:30>
   [[file:/usr/local/git/0--key/org-pub/2017-08-07-nosql.org::*The%20Main%20Purpose][The Main Purpose]]

* Postgres

** Relational Algebra
   :PROPERTIES:
   :CATEGORY: Algebra
   :END:
   :LOGBOOK:
   CLOCK: [2018-03-17 Sat 09:04]--[2018-03-17 Sat 09:26] =>  0:22
   CLOCK: [2018-03-17 Sat 08:28]--[2018-03-17 Sat 09:00] =>  0:32
   CLOCK: [2018-03-15 Thu 08:27]--[2018-03-15 Thu 08:58] =>  0:31
   CLOCK: [2018-03-13 Tue 07:59]--[2018-03-13 Tue 08:26] =>  0:27
   :END:
   <2018-03-24 Sat 08:30-09:00>
   [[file:/usr/local/git/0--key/org-pub/2017-08-10-relational-algebra.org::*Prerequisites][Prerequisites]]

* Emacs
  :PROPERTIES:
  :CATEGORY: Emacs
  :END:

** Elpy
   :LOGBOOK:
   CLOCK: [2018-03-13 Tue 09:57]--[2018-03-13 Tue 10:43] =>  0:46
   CLOCK: [2018-03-12 Mon 10:14]--[2018-03-12 Mon 10:35] =>  0:21
   :END:

   <2018-03-13 Tue 10:00-10:30>
   [[file:/usr/local/git/0--key/org-pub/2017-08-03-elpy.org::*The%20Main%20Purpose][The Main Purpose]]

*** New venvs deployment
    :PROPERTIES:
    :CATEGORY: Elpy
    :END:
    :LOGBOOK:
    CLOCK: [2018-03-15 Thu 10:06]--[2018-03-15 Thu 10:18] =>  0:12
    :END:

    only pure Elpy testing
    [[file:/usr/local/git/0--key/org-pub/2017-08-03-elpy.org::*An%20empty%20=venv=%20creation][An empty =venv= creation]]
    [[file:/usr/local/share/pyVenvs/alioth/][Venv folder]]
    <2018-03-24 Sat 10:00-10:30>

** [#A] Custom functions
   <2018-03-16 Fri 11:30-12:00>
   [[file:/usr/local/share/emacs/site-lisp/default.el][file:/usr/local/share/emacs/site-lisp/default.el]]

* FMSD
** Program Development
  :PROPERTIES:
  :CATEGORY: FMSD
  :END:
  :LOGBOOK:
  CLOCK: [2018-03-12 Mon 13:24]--[2018-03-12 Mon 13:51] =>  0:27
  :END:
   <2018-03-24 Sat 13:20-13:50>
* Python
  :PROPERTIES:
  :CATEGORY: Linux
  :END:

** Concurrent Programming

*** Intro
    :LOGBOOK:
    CLOCK: [2018-03-13 Tue 08:36]--[2018-03-13 Tue 09:01] =>  0:25
    :END:
    <2018-03-13 Tue 08:30-09:00>

*** Linux Processes Dissection
    :LOGBOOK:
    CLOCK: [2018-03-16 Fri 09:38]--[2018-03-16 Fri 10:16] =>  0:38
    CLOCK: [2018-03-15 Thu 09:18]--[2018-03-15 Thu 09:22] =>  0:04
    CLOCK: [2018-03-13 Tue 09:01]--[2018-03-13 Tue 09:14] =>  0:13
    :END:
    <2018-03-24 Sat 10:00-10:30>
    [[file:/usr/local/git/0--key/org-pub/2017-08-15-py-parallel.org::*Core%20features][Core features]]
